
print ('Вид питомца')
typepit = input()

print ('Возраст питомца')
agepit = int(input())

print ('Имя питомца')
namepit = input()


print("Это", typepit, "По кличке",  namepit, "Возраст:", agepit, "года/лет")


print ('введите название первого этапа развития человека')
a = input()

print ('введите название второго этапа развития человека')
b = input()

print ('введите название третьего этапа развития человека')
c = input()

print ('введите название четвертого этапа развития человека')
d = input()

print ('введите название пятого этапа развития человека')
e = input()

print ('введите название шестого этапа развития человека')
f = input()


print(a, b, c, d, e, f, sep="=>")


#Проверка сихронизации с
